; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   blue_box_1 - box
   red_ball_1 - ball
   empty - empty_0
   blue_door_1 grey_door_1 - door
   room_4 - room
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (seen_psi_1) (hold_2) (seen_psi_3) (hold_4) (hold_5))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (when (= ?obj blue_box_1) (seen_psi_3)) (when (or (not (emptyhands)) (= ?obj red_ball_1)) (hold_5)) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (when (not (emptyhands)) (hold_5)) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))) (or (not (= ?door grey_door_1)) (seen_psi_3)))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (when (= ?door grey_door_1) (hold_2)) (when (not (emptyhands)) (hold_5)) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)) (or (not (or (= ?room2 room_4) (and (agentinroom room_4) (not (= ?room1 room_4))))) (seen_psi_1)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (or (= ?room2 room_4) (and (agentinroom room_4) (not (= ?room1 room_4)))) (hold_0)) (when (not (emptyhands)) (hold_5)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (seen_psi_1) (when (and (at_ blue_box_1) (not (= ?obj blue_box_1))) (seen_psi_3)) (hold_4) (hold_5) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (or (= ?obj blue_box_1) (at_ blue_box_1)) (seen_psi_3)) (when (or (= ?obj red_ball_1) (at_ red_ball_1)) (hold_5)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door) (or (and (not (locked ?door)) (= ?door blue_door_1)) (and (locked blue_door_1) (not (and (locked ?door) (= ?door blue_door_1))))))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 room_2 room_3 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   red_door_1 purple_door_1 - door
   yellow_box_1 - box
   purple_ball_1 grey_ball_1 grey_ball_3 grey_ball_2 yellow_ball_1 - ball
 )
 (:init (agentinroom room_2) (objectinroom yellow_box_1 room_1) (objectinroom red_ball_1 room_1) (objectinroom grey_ball_1 room_1) (objectinroom grey_ball_2 room_1) (objectinroom blue_box_1 room_3) (objectinroom yellow_ball_1 room_3) (objectinroom grey_ball_3 room_4) (objectinroom purple_ball_1 room_4) (objectcolor yellow_box_1 yellowtype) (objectcolor red_ball_1 redtype) (objectcolor grey_ball_1 greytype) (objectcolor grey_ball_2 greytype) (objectcolor blue_box_1 bluetype) (objectcolor yellow_ball_1 yellowtype) (objectcolor grey_ball_3 greytype) (objectcolor purple_ball_1 purpletype) (objectcolor red_door_1 redtype) (objectcolor purple_door_1 purpletype) (objectcolor blue_door_1 bluetype) (objectcolor grey_door_1 greytype) (emptyhands) (locked red_door_1) (locked purple_door_1) (locked blue_door_1) (locked grey_door_1) (adjacentrooms room_2 room_1 red_door_1) (adjacentrooms room_1 room_2 red_door_1) (adjacentrooms room_3 room_1 purple_door_1) (adjacentrooms room_1 room_3 purple_door_1) (adjacentrooms room_4 room_2 blue_door_1) (adjacentrooms room_2 room_4 blue_door_1) (adjacentrooms room_4 room_3 grey_door_1) (adjacentrooms room_3 room_4 grey_door_1) (visited room_2) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d greytype) (adjacentrooms room_3 room_4 ?d) (at_ ?d) (not (locked ?d)))) (hold_0) (hold_2) (hold_4) (hold_5)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor red_door_1 room_2 room_1)
   added: (at_ red_door_1)
   goals met: 0 of 5
2. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 0 of 5
3. (gotoroom room_2 room_1 red_door_1)
   deleted: (agentinroom room_2) (at_ red_door_1)
   added: (agentinroom room_1) (visited room_1)
   goals met: 0 of 5
4. (gotodoor purple_door_1 room_1 room_3)
   added: (at_ purple_door_1)
   goals met: 0 of 5
5. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 0 of 5
6. (gotoroom room_1 room_3 purple_door_1)
   deleted: (agentinroom room_1) (at_ purple_door_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 0 of 5
7. (gotoobject blue_box_1 room_3)
   added: (at_ blue_box_1) (seen_psi_3)
   goals met: 0 of 5
8. (pick blue_box_1 room_3)
   deleted: (at_ blue_box_1) (emptyhands) (objectinroom blue_box_1 room_3)
   added: (carrying blue_box_1) (seen_psi_1) (hold_4) (hold_5)
   goals met: 2 of 5
9. (gotodoor grey_door_1 room_3 room_4)
   added: (at_ grey_door_1) (hold_2)
   goals met: 3 of 5
10. (toggle grey_door_1)
   deleted: (locked grey_door_1)
   goals met: 4 of 5
11. (gotoroom room_3 room_4 grey_door_1)
   deleted: (agentinroom room_3) (at_ grey_door_1)
   added: (agentinroom room_4) (visited room_4) (hold_0)
   goals met: 4 of 5
12. (gotodoor grey_door_1 room_4 room_3)
   added: (at_ grey_door_1)
   goals met: 5 of 5
